In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import sqlite3

import datetime

from wordcloud import WordCloud
from wordcloud import STOPWORDS

import math
import numpy as np

In [2]:
data = sqlite3.connect('/Users/cp/Documents/dsi/8a_kaggle/database.sqlite')

In [32]:
df_save = pd.read_sql_query("SELECT name, user_id, rating, date FROM ascent ", data)

In [51]:
df_save.head()

             name  user_id  rating       date
0  The King And I        1       0  918342000
1          vet ej        1       0  925509600
2          Mr Big        1       0  933026400
3   Tak ska du ha        1       0  933026400
4   Korpen flyger        1       0  933458400

In [36]:
df_dict = {}

In [61]:
# df_value_counts = df_save.value_counts().rename_axis('name').reset_index(name='counts')
df_value_counts = df_save.name.value_counts()

In [63]:
df_value_counts.head()
type(df_value_counts.head())

pandas.core.series.Series

In [54]:
# df_value_counts['index_colum'] = range(1, len(df) + 1)
def value_counts_df(df, col):
    """
    Returns pd.value_counts() as a DataFrame

    Parameters
    ----------
    df : Pandas Dataframe
        Dataframe on which to run value_counts(), must have column `col`.
    col : str
        Name of column in `df` for which to generate counts

    Returns
    -------
    Pandas Dataframe
        Returned dataframe will have a single column named "count" which contains the count_values()
        for each unique value of df[col]. The index name of this dataframe is `col`.

    Example
    -------
    >>> value_counts_df(pd.DataFrame({'a':[1, 1, 2, 2, 2]}), 'a')
       count
    a
    2      3
    1      2
    """
    df = pd.DataFrame(df[col].value_counts())
    df.index.name = col
    df.columns = ['count']
    return df

In [55]:
df_value_counts1 = value_counts_df(df_save, 'name')

In [68]:
# df_value_counts1.head(50)
type(df_value_counts1)
df_value_counts1.iloc[159]

count    479
Name: Tortuga, dtype: int64

In [69]:
df_value_counts1.head()

                 count
name
?                58996
???              10290
??                7918
Don't know name   4858
¿?                4789

In [70]:
df_value_counts1.reset_index()

                             name  count
0                               ?  58996
1                             ???  10290
2                              ??   7918
3                 Don't know name   4858
4                              ¿?   4789
...                           ...    ...
886935             Road Kill Meal      1
886936    Compositions des forces      1
886937  Venha a Nós o Nosso Reino      1
886938            Max Scene Arete      1
886939            Cedar Variation      1

[886940 rows x 2 columns]

In [47]:
type(df_value_counts)

pandas.core.series.Series

In [33]:
df_save.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4111877 entries, 0 to 4111876
Data columns (total 4 columns):
 #   Column   Dtype
---  ------   -----
 0   name     object
 1   user_id  int64
 2   rating   int64
 3   date     int64
dtypes: int64(3), object(1)
memory usage: 125.5+ MB

In [34]:
df_2= pd.read_csv('~/Documents/dsi/8a_kaggle/dev_imac2/ascents_spark.csv')

In [35]:
df_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4111877 entries, 0 to 4111876
Data columns (total 5 columns):
 #   Column      Dtype
---  ------      -----
 0   Unnamed: 0  int64
 1   name        object
 2   user_id     int64
 3   rating      int64
 4   date        int64
dtypes: int64(4), object(1)
memory usage: 156.9+ MB

In [ ]:
df_save.to_csv('~/Documents/dsi/8a_kaggle/dev_imac2/ascents_spark.csv')

In [21]:
df = pd.read_sql_query("SELECT id, user_id, rating, date FROM ascent ", data)

In [6]:
global_mean = pd.read_sql_query("SELECT AVG(rating) FROM ascent ", data)

In [7]:
global_mean.head()

   AVG(rating)
0     1.174658

In [8]:
user_result = pd.read_sql_query("SELECT user_id, AVG(rating) FROM ascent group by user_id order by user_id ", data)

In [10]:
user_result.head(20)

    user_id  AVG(rating)
0         1     0.742857
1         2     1.000000
2         3     0.327869
3         4     0.683333
4         5     1.280206
5         6     1.161290
6        10     1.165527
7        11     0.007194
8        12     0.282051
9        13     0.000000
10       14     0.000000
11       15     2.290123
12       16     1.889535
13       17     0.600000
14       18     1.642276
15       19     0.539683
16       24     2.000000
17       25     2.000000
18       26     1.666667
19       27     2.375000

In [12]:
user_result.iloc[3]

user_id        4.000000
AVG(rating)    0.683333
Name: 3, dtype: float64

In [15]:
route_result = pd.read_sql_query("SELECT name, AVG(rating) FROM ascent group by name order by name ", data)

In [16]:
route_result.head(20)

                                 name  AVG(rating)
0                                         0.899054
1       \t Massacre À La Tronconneuse     0.000000
2                         \tDinosaure     1.000000
3                   \tEarth to Stella     1.000000
4                   \tExpress sumarqu     3.000000
5                   \tIndigo Galliace     3.000000
6                   \tLa farse tranqu     2.000000
7                   \tMove Over Bruss     0.000000
8               \tProstowanie wariant     1.000000
9                        \tSlip Bouse     2.000000
10                        \tSpit Bull     2.000000
11                  \tgagae de ma par     3.000000
12                  \tpeur aux tafiol     3.000000
13                  \tpriez pour nous     3.000000
14

....     0.000000
15               \t Aresta dinamitada     3.000000
16               \t Io sto con gli ip     0.000000
17   \t Le P'tit Toit / Le Tourniquet     3.000000
18         \t Unendliche Geschichte 1     3.000000
19                    \tAire de Repos     3.000000

In [19]:
route_result.loc[260]

name            egg boulder
AVG(rating)               0
Name: 260, dtype: object

In [23]:
df.tail(20)

              id  user_id  rating        date
4111857  4910302    57766       0  1504562400
4111858  4910310    33313       2  1186956000
4111859  4910311    33313       3  1187042400
4111860  4910312    33313       3  1186956000
4111861  4910317    34923       3  1410904800
4111862  4910323    53784       0  1504562400
4111863  4910324    53784       0  1504562400
4111864  4910325    53784       0  1504562400
4111865  4910326    63280       0  1505167200
4111866  4910329    63280       0  1505167200
4111867  4910330     4464       3  1504994400
4111868  4910331     4464       2  1504994400
4111869  4910332     4464       2  1504994400
4111870  4910339    19775       0  1505167200
4111871  4910340    19775       0  1505167200
4111872  4910370    59627       2  1505167200
4111873  4910371    44075       0  1505080800
4111874  4910376    19098       0  1504994400
4111875  4910379    19098       2  1505080800
4111876  4910381    24751       0  1504994400

In [25]:
training_df, test_df = df.randomSplit([0.8, 0.2])

AttributeError: 'DataFrame' object has no attribute 'randomSplit'